In [ ]:
import pandas as pd

In [ ]:
t_df = pd.read_csv('train.csv',sep=',')

In [ ]:
t_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Количество точек данных

In [ ]:
t_df.size

10692

Количество полей данных

In [ ]:
t_df.shape[1]

12

Тип данных каждого поля

In [ ]:
t_df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
t_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Количество отсутствующих значений для каждого поля

In [ ]:
t_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
t_df.value_counts()

PassengerId  Survived  Pclass  Name                                                  Sex     Age   SibSp  Parch  Ticket    Fare      Cabin  Embarked
2            1         1       Cumings, Mrs. John Bradley (Florence Briggs Thayer)   female  38.0  1      0      PC 17599  71.2833   C85    C           1
572          1         1       Appleton, Mrs. Edward Dale (Charlotte Lamson)         female  53.0  2      0      11769     51.4792   C101   S           1
578          1         1       Silvey, Mrs. William Baird (Alice Munger)             female  39.0  1      0      13507     55.9000   E44    S           1
582          1         1       Thayer, Mrs. John Borland (Marian Longstreth Morris)  female  39.0  1      1      17421     110.8833  C68    C           1
584          0         1       Ross, Mr. John Hugo                                   male    36.0  0      0      13049     40.1250   A10    C           1
                                                                                                                                                       ..
328          1         2       Ball, Mrs. (Ada E Hall)                               female  36.0  0      0      28551     13.0000   D      S           1
330          1         1       Hippach, Miss. Jean Gertrude                          female  16.0  0      1      111361    57.9792   B18    C           1
332          0         1       Partner, Mr. Austen                                   male    45.5  0      0      113043    28.5000   C124   S           1
333          0         1       Graham, Mr. George Edward                             male    38.0  0      1      PC 17582  153.4625  C91    S           1
890          1         1       Behr, Mr. Karl Howell                                 male    26.0  0      0      111369    30.0000   C148   C           1
Length: 183, dtype: int64

**4.** Удалить из набора поля, не несущие информативной нагрузки - содержащие уникальные либо константные значения

In [ ]:
t_df = t_df.drop(columns=['Cabin', 'Ticket'])

In [ ]:
t_df[0:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

**5.** Заменить возраст пассажиров на год рождения

In [ ]:
t_df["Age"] = (1912 - t_df["Age"])

In [ ]:
t_df["Age"][0:5]

0    1890.0
1    1874.0
2    1886.0
3    1877.0
4    1877.0
Name: Age, dtype: float64

**6.** Переименовать все названия колонок на русском языке

In [ ]:
t_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Fare', 'Embarked'],
      dtype='object')

In [ ]:
df_columns_old = list(t_df.columns)
df_columns_new = ['Идентификатор пассажира', 'Пассажиров выжило','Класс пассажира','Имя','Пол','Год рождения','Братьев и сестер/Супругов на борту','Родителей/детей на борту','Пассажирский тариф','Порт погрузки']

In [ ]:
t_df.rename(columns=dict(zip(df_columns_old, df_columns_new)), inplace=True)

In [ ]:
t_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Идентификатор пассажира             891 non-null    int64
 1   Пассажиров выжило                   891 non-null    int64
 2   Класс пассажира                     891 non-null    int64
 3   Имя                                 891 non-null    object
 4   Пол                                 891 non-null    object
 5   Год рождения                        714 non-null    float64
 6   Братьев и сестер/Супругов на борту  891 non-null    int64
 7   Родителей/детей на борту            891 non-null    int64
 8   Пассажирский тариф                  891 non-null    float64
 9   Порт погрузки                       889 non-null    object
dtypes: float64(2), int64(5), object(3)
memory usage: 69.7+ KB

**7.** Заменить все отсутствующие данные средним значением (в случае числового поля) либо самым распространенным в категориальных полях.

Отсутствующие данные есть в столбце `Год рождения` (числовое поле) и в столбце `Порт погрузки` (категориальное поле)

In [ ]:
t_df.isna().sum()

Идентификатор пассажира                 0
Пассажиров выжило                       0
Класс пассажира                         0
Имя                                     0
Пол                                     0
Год рождения                          177
Братьев и сестер/Супругов на борту      0
Родителей/детей на борту                0
Пассажирский тариф                      0
Порт погрузки                           2
dtype: int64

In [ ]:
t_df['Год рождения'].mean()

1882.3008823529412

In [ ]:
t_df['Год рождения'][t_df['Год рождения'].isna()==True]=t_df['Год рождения'].mean()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
# t_df['Год рождения'].fiilna(t_df['Год рождения'].mean())

In [ ]:
t_df['Год рождения'].isna().sum()

0

In [ ]:
most_common_embarked = (t_df['Порт погрузки'].value_counts()).sort_values(ascending=False)[0:1].index[0]
most_common_embarked

'S'

In [ ]:
t_df['Порт погрузки'][t_df['Порт погрузки'].isna()==True]=most_common_embarked

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
# t_df['Порт погрузки'].fillna(most_common_embarked)

In [ ]:
t_df['Порт погрузки'].isna().sum()

0

**8.** Сохранить получившийся набор данных в формате CSV

In [ ]:
t_df.to_csv('titanik_new.csv',index=False, encoding='cp1251')